Examinator/src/Documents/ОтветНаВопросСУЗ/ОтветНаВопросСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтветНаВопросСУЗ</name>
  <registerRecords>InformationRegister.ОтветыНаВопросыСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовВопросовСУЗ</registerRecords>
  <attributes>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервогоПоказаВопроса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПоказаВопроса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияВопроса</name>
    <comment>УДАЛИТЬ</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фасет</name>
    <type>
      <types>CatalogRef.ФасетыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросОтвечен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазвернутыйОтветПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованаПодсказка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БаллЗаПсихологическийВопрос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПсихологическийВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>ВариантОтвета</name>
      <type>
        <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВарианта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыбраннаяГруппа</name>
      <type>
        <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыбраннаяКатегория</name>
      <type>
        <types>CatalogRef.КатегорииВариантовОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияВарианта</name>
      <comment>Номер позиции для вопросов типа Последовательность</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерныйВыбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерныйНеВыбран</name>
      <comment>Равно Истина, если вариант верный, но не был выбран пользователем.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибочныйВыбран</name>
      <comment>Равно Истина, если вариант является дистрактором и был выбран.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибочныйНеВыбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыВариантовОтветов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииВариантовОтветов</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииВариантовОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКатегории</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветыПоШаблону</name>
    <comment>Используется в вопросах типа &quot;По шаблону&quot;</comment>
    <attributes>
      <name>ГруппаВариантов</name>
      <type>
        <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОтвета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияОтветовНаВопрос</name>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтвета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РазвернутыйОтветПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверенПреподавателем</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверившийПреподаватель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыПопытки</name>
      <comment>Дата, когда пользователь нажал кнопку &quot;Повторить ответ&quot;</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомментария</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальныеДанные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыеДанные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВебСсылка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ОтветыНаВопросыСУЗ/ОтветыНаВопросыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветыНаВопросыСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПсихологическийВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованаПодсказка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазвернутыйОтветПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВыбранныеВариантыОтветовВопросовСУЗ/ВыбранныеВариантыОтветовВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыбранныеВариантыОтветовВопросовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Выбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерныйВыбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерныйНеВыбран</name>
    <comment>Равно Истина, если вариант верный, но не был выбран пользователем.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибочныйВыбран</name>
    <comment>Равно Истина, если вариант является дистрактором и был выбран.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибочныйНеВыбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантОтвета</name>
    <type>
      <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/МетодыРасчетаРезультатаВопросаСУЗ/МетодыРасчетаРезультатаВопросаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыРасчетаРезультатаВопросаСУЗ</name>
  <enumValues>
    <name>ТочноеСовпадение</name>
  </enumValues>
  <enumValues>
    <name>ПроцентВерных</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ОтветНаВопросСУЗ/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС


// Выполняет действия при ответе на вопрос.
//
Функция ОбработатьОтветНаВопрос(ПараметрыСсылки, КонтекстВыполнения, Поставщик) Экспорт
	
	РезультатОбработки = Новый Структура("Код, Текст", 0, "");
	
	Если ЗначениеЗаполнено(СессияВыполненияТеста) Тогда
		
		Подборка       = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СессияВыполненияТеста, "Подборка");
		ДанныеПодборки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подборка, "ИсключитьОткрытыеВопросы");
		
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////
	// 1. Смотрим можно ли отвечать на вопрос
	
	Если ВопросОтвечен ИЛИ СессияВыполненияТеста.ТестЗавершен Тогда
		
		РезультатОбработки.Вставить("Код", 5); 
		РезультатОбработки.Вставить("Текст", НСтр("ru = 'На вопрос уже был получен ответ'")); 
		
		Возврат РезультатОбработки;
		
	КонецЕсли;
	
	Если Пользователь <> ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения)
		ИЛИ (ЗначениеЗаполнено(СессияВыполненияТеста) И СессияВыполненияТеста.Пользователь <> ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения)) Тогда
		
		ОписаниеОшибки = НСтр("ru = 'Значения переменных. Пользователь вопроса: %1; Пользователь сеанса: %2; Сессия теста: %3; Пользователь теста: %4'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, Пользователь, ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения), СессияВыполненияТеста, СессияВыполненияТеста.Пользователь);
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Доступ.Ответ на вопрос'"), УровеньЖурналаРегистрации.Ошибка, Метаданные(), Ссылка, ОписаниеОшибки);
		
		РезультатОбработки.Вставить("Код", 6); 
		РезультатОбработки.Вставить("Текст", НСтр("ru = 'Пользователь сессии выполнения теста отличается от текущего. Невозможно обработать ответ. Сообщите администратору об ошибке'"));
		
		Возврат РезультатОбработки;
		
	КонецЕсли;
	
  	// Определяем время, сколько уже выполняется тест
    ВыполняетсяТест = ТекущаяДата() - СессияВыполненияТеста.ДатаНачалаВыполненияТеста;
    			
    // Определяем сколько можно выполнять тест
    ЗаданоВремяТеста = СессияВыполненияТеста.ВремяТеста;
    ВремяТестаВСекундах = Секунда(ЗаданоВремяТеста) + Минута(ЗаданоВремяТеста)*60 + Час(ЗаданоВремяТеста)*3600;
    
    Если ВремяТестаВСекундах > 0 И ВремяТестаВСекундах < ВыполняетсяТест Тогда
		
		РезультатОбработки.Вставить("Код", 7); 
		РезультатОбработки.Вставить("Текст", НСтр("ru = 'Закончилось отведенное время'")); 
		
		Возврат РезультатОбработки;
		
    КонецЕсли;	
	
	/////////////////////////////////////////////////////////////////////////
	// 2. Сохраняем все данные об ответе пользователя.
	
	ТипВопроса = Вопрос.ТипВопроса;
	
	ПсихологическийВопрос = ?(ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногихПсихологический
	                          ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.МногиеИзМногихПсихологический, Истина, Ложь); // Сохраняем в реквизит
	
	// Помечаем выбранные пользователем варианты ответов
	Если ТипВопроса <> Перечисления.ТипыВопросовСУЗ.ЭлементActiveX
		И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.Открытый
		И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.РаботаВПрограмме
		И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.Последовательность Тогда

		Ответ = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "variant");
		
		Если Ответ = Неопределено
			И ЗначениеЗаполнено(СессияВыполненияТеста)
			И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.ПоШаблону Тогда
			
			// Примечание: если мы отвечаем на вопрос вне теста, то проверка не делается,
			// Так как это может быть тестирование вопроса и вариантов ответов может совсем не быть.
			// Тогда получится замкнутый круг, когда вопрос не обновиться и ответить на него нельзя.
			
			РезультатОбработки.Вставить("Код", 8); 
			РезультатОбработки.Вставить("Текст", НСтр("ru = 'Укажите ответ'")); 
			
			Возврат РезультатОбработки;
			
    	КонецЕсли;		
    	
    	// Формируем массив ответов
    	
    	МассивНомеровВариантов = Новый Массив();
    	
    	Если ТипЗнч(Ответ) = Тип("Строка") И НЕ ПустаяСтрока(Ответ) Тогда
			МассивНомеровВариантов.Добавить(Число(Ответ));
    	КонецЕсли;
    	
		Если ТипЗнч(Ответ) = Тип("Массив") Тогда
			МассивНомеровВариантов = Ответ;
			Для А=0 По МассивНомеровВариантов.Количество()-1 Цикл
				МассивНомеровВариантов[А] = Число(МассивНомеровВариантов[А]);
    		КонецЦикла;
    	КонецЕсли;
		
		Для каждого НомерВарианта Из МассивНомеровВариантов Цикл
			ВариантВТЧ = ВариантыОтветов.Найти(НомерВарианта, "НомерВарианта");
			Если ВариантВТЧ <> Неопределено Тогда
				ВариантВТЧ.Выбран = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Открытый Тогда
		
		Если НЕ ЗначениеЗаполнено(ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "fullAnswer")) Тогда
			РезультатОбработки.Вставить("Код", 8); 
			РезультатОбработки.Вставить("Текст", НСтр("ru = 'Укажите ответ'")); 			
			Возврат РезультатОбработки;			
		КонецЕсли;
		
	КонецЕсли;
	
	// Помечаем выбранные группы
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Таблица
		ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.Соответствие Тогда
		
		Для каждого Вариант Из ВариантыОтветов Цикл
		
			ИмяПараметра = "variantGroup_" + Строка(Вариант.НомерВарианта);
			НомерВыбраннойГруппы = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, ИмяПараметра);
			
			Если НЕ ПустаяСтрока(НомерВыбраннойГруппы) Тогда
				
				Попытка
					НомерВыбраннойГруппы = Число(НомерВыбраннойГруппы);
					ГруппаВТЧ = ГруппыВариантовОтветов.Найти(НомерВыбраннойГруппы, "НомерГруппы");
				Исключение
					ГруппаВТЧ = Неопределено;
				КонецПопытки;
				
				Если ГруппаВТЧ <> Неопределено Тогда
					Вариант.ВыбраннаяГруппа = ГруппаВТЧ.Группа;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	// Помечаем выбранные категории
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Таблица Тогда
		
		Для каждого Вариант Из ВариантыОтветов Цикл
		
			ИмяПараметра = "variantCategory_" + Строка(Вариант.НомерВарианта);
			НомерВыбраннойКатегории = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, ИмяПараметра);
			
			Если НЕ ПустаяСтрока(НомерВыбраннойКатегории) Тогда
				
				НомерВыбраннойКатегории = Число(НомерВыбраннойКатегории);
				КатегорияВТЧ = КатегорииВариантовОтветов.Найти(НомерВыбраннойКатегории, "НомерКатегории");
				
				Если КатегорияВТЧ <> Неопределено Тогда
					Вариант.ВыбраннаяКатегория = КатегорияВТЧ.Категория;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	// Запоминаем позицию варианта в вопросах на последовательность
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Последовательность Тогда
		
		Для каждого Вариант Из ВариантыОтветов Цикл
		
			ИмяПараметра = "positionVariant_" + Строка(Вариант.НомерВарианта);
			ПозицияВарианта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, ИмяПараметра);
			
			Если НЕ ПустаяСтрока(ПозицияВарианта) Тогда
				Вариант.ПозицияВарианта = Число(ПозицияВарианта);
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;	
	
	// Запоминаем текстовые ответы пользователя в вопросах по шаблону
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ПоШаблону Тогда
		
		ИмяПараметра = "group_0";
		ОсновнойОтвет = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, ИмяПараметра);
		
		Если НЕ ПустаяСтрока(ОсновнойОтвет) Тогда
			ОтветПоШаблону = ОтветыПоШаблону.Добавить();
			ОтветПоШаблону.ТекстОтвета = ОсновнойОтвет; 
		КонецЕсли;
		
		Для каждого ГруппаОтветов Из ГруппыВариантовОтветов Цикл
		
			ИмяПараметра = "group_" + Строка(ГруппаОтветов.НомерГруппы);
			ОтветГруппы = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, ИмяПараметра);
			
			Если НЕ ПустаяСтрока(ОтветГруппы) Тогда
				ОтветПоШаблону = ОтветыПоШаблону.Добавить();
				ОтветПоШаблону.ТекстОтвета = ОтветГруппы; 
				ОтветПоШаблону.ГруппаВариантов = ГруппаОтветов.Группа;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	// Запоминаем открытый ответ пользователя, он же развернутый ответ
	
	Если Справочники.ВопросыСУЗ.РазрешенРазвернутыйОтветНаВопрос(Вопрос, ДанныеПодборки) Тогда
		РазвернутыйОтветПользователя = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "fullAnswer");
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////
	//3. Считаем результат
	
	Если ТипВопроса <> Перечисления.ТипыВопросовСУЗ.Открытый
		И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.РаботаВПрограмме
		И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.ЭлементActiveX Тогда 
	
		// Заполняем таблицу вариантов ответов
		
		ТаблицаВариантовОтветов = ВариантыОтветов.Выгрузить();
		ТаблицаВариантовОтветов.Колонки.Добавить("Верный");
		ТаблицаВариантовОтветов.Колонки.Добавить("Категория");
		ТаблицаВариантовОтветов.Колонки.Добавить("Группа");
		ТаблицаВариантовОтветов.Колонки.Добавить("Код");
		ТаблицаВариантовОтветов.Колонки.Добавить("ВернаяГруппаФасетов");
		ТаблицаВариантовОтветов.Колонки.Добавить("БаллПриПсихологическомТестировании");
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВариантыОтветовНаВопросСУЗ.Ссылка КАК ВариантОтвета,
		                      |	ВариантыОтветовНаВопросСУЗ.Родитель КАК Группа,
		                      |	ВариантыОтветовНаВопросСУЗ.ЭтоГруппа,
		                      |	ВариантыОтветовНаВопросСУЗ.Код,
		                      |	ВариантыОтветовНаВопросСУЗ.ВернаяГруппаФасетов,
		                      |	ВариантыОтветовНаВопросСУЗ.Верный,
		                      |	ВариантыОтветовНаВопросСУЗ.ПредлагатьВыборВариантов,
		                      |	ВариантыОтветовНаВопросСУЗ.Категория,
		                      |	ВариантыОтветовНаВопросСУЗ.БаллПриПсихологическомТестировании
		                      |ИЗ
		                      |	Справочник.ВариантыОтветовНаВопросСУЗ КАК ВариантыОтветовНаВопросСУЗ
		                      |ГДЕ
		                      |	ВариантыОтветовНаВопросСУЗ.Владелец = &Вопрос
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ВариантыОтветовНаВопросСУЗ.Ссылка ИЕРАРХИЯ");			
		
		Запрос.УстановитьПараметр("Вопрос", Вопрос);
		
		ВыборкаВариантовОтветов = Запрос.Выполнить().Выбрать();
		
		Для каждого Вариант Из ТаблицаВариантовОтветов Цикл
			
			ВыборкаВариантовОтветов.Сбросить();
			
			Если ВыборкаВариантовОтветов.НайтиСледующий(Вариант.ВариантОтвета, "ВариантОтвета") Тогда
				
				Вариант.Верный                             = ВыборкаВариантовОтветов.Верный;
				Вариант.Категория                          = ВыборкаВариантовОтветов.Категория;
				Вариант.Группа                             = ВыборкаВариантовОтветов.Группа;
				Вариант.Код                                = ВыборкаВариантовОтветов.Код;
				Вариант.ВернаяГруппаФасетов                = ВыборкаВариантовОтветов.ВернаяГруппаФасетов;
				Вариант.БаллПриПсихологическомТестировании = ВыборкаВариантовОтветов.БаллПриПсихологическомТестировании;
				
			Иначе
				
				РезультатОбработки.Вставить("Код", 1); 
				РезультатОбработки.Вставить("Текст", НСтр("ru = 'Вариант ответа не найден'")); 
				
				Возврат РезультатОбработки;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Заполняем таблицу групп вариантов
		
		ТаблицаГруппВариантов = ГруппыВариантовОтветов.Выгрузить();
		ТаблицаГруппВариантов.Колонки.Добавить("ПредлагатьВыборВариантов");
		ТаблицаГруппВариантов.Колонки.Добавить("Код");
		
		Для каждого ГруппаВариантов Из ТаблицаГруппВариантов Цикл
			
			ВыборкаВариантовОтветов.Сбросить();
			
			Если ВыборкаВариантовОтветов.НайтиСледующий(ГруппаВариантов.Группа, "ВариантОтвета") Тогда
				ГруппаВариантов.ПредлагатьВыборВариантов = ВыборкаВариантовОтветов.ПредлагатьВыборВариантов;
				ГруппаВариантов.Код = ВыборкаВариантовОтветов.Код;
			Иначе
				
				РезультатОбработки.Вставить("Код", 2); 
				РезультатОбработки.Вставить("Текст", НСтр("ru = 'Вариант ответа не найден /2'")); 
				
				Возврат РезультатОбработки;
				
			КонецЕсли;
			
		КонецЦикла;
		
	    // Если вопрос фасетный, убираем пометку Верный у тех вариантов,
	    // Которые не относятся к текущему фасету и для которых указана
		// Какая-либо другая группа фасетов.
	    Если Вопрос.ФасетныйВопрос Тогда
	    	
	    	ИдентификаторФасета = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "facet");
	    	УникальныйИдентификаторФасета = Новый УникальныйИдентификатор(ИдентификаторФасета);
	    	
	    	ТекущаяГруппаФасетов = Справочники.ФасетыВопросовСУЗ.ПолучитьСсылку(УникальныйИдентификаторФасета).Родитель;
	    	
	    	Для Каждого Вариант Из ТаблицаВариантовОтветов Цикл
				Если ЗначениеЗаполнено(Вариант.ВернаяГруппаФасетов)
					И Вариант.ВернаяГруппаФасетов <> ТекущаяГруппаФасетов Тогда
	    				Вариант.Верный = Ложь;
	    		КонецЕсли;
	    	КонецЦикла;
	    	
	    КонецЕсли;

	КонецЕсли;
		
	////////////////////////////////////////////////////////////////////////////
	// Находим результат в зависимости от типа вопроса
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.МногиеИзМногих
		ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногих Тогда
		
		ВсегоВерных = 0;
		ВыбраноВерных = 0;
		ВыбраноНеверных = 0;
		Результат = 0;
		
		Для Каждого Вариант Из ТаблицаВариантовОтветов Цикл
			
			ВариантВТЧ = ВариантыОтветов.Найти(Вариант.ВариантОтвета, "ВариантОтвета");
			
			Если Вариант.Верный Тогда
				ВсегоВерных = ВсегоВерных + 1;
			КонецЕсли;
			
			Если Вариант.Выбран И Вариант.Верный Тогда
				ВыбраноВерных = ВыбраноВерных + 1;
				ВариантВТЧ.ВерныйВыбран = Истина;
			КонецЕсли;
			
			Если Вариант.Выбран И НЕ Вариант.Верный Тогда
				ВыбраноНеверных = ВыбраноНеверных + 1;
				ВариантВТЧ.ОшибочныйВыбран = Истина;
			КонецЕсли;
			
			Если НЕ Вариант.Выбран И Вариант.Верный Тогда
				ВариантВТЧ.ВерныйНеВыбран = Истина;
			КонецЕсли;
			
			Если НЕ Вариант.Выбран И НЕ Вариант.Верный Тогда
				ВариантВТЧ.ОшибочныйНеВыбран = Истина;
			КонецЕсли;
			
		КонецЦикла;
	
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногих
			И ВыбраноВерных > 0
			И ВсегоВерных > 0 Тогда
			
			Результат = 100;
			
		КонецЕсли;	
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.МногиеИзМногих Тогда
			
			МетодРасчетаРезультата = Вопрос.МетодРасчетаРезультата;
			
			Если НЕ ЗначениеЗаполнено(МетодРасчетаРезультата) Тогда
				МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ТочноеСовпадение;
			КонецЕсли;
			
			Если ВыбраноНеверных = 0 И МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ПроцентВерных Тогда
				Результат = Окр((ВыбраноВерных / ВсегоВерных)*100);
			КонецЕсли;
			
			Если МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ТочноеСовпадение Тогда
				Если ВыбраноВерных = ВсегоВерных И ВыбраноНеверных = 0 Тогда
					Результат = 100;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПсихологическийВопрос Тогда
		
		БаллЗаПсихологическийВопрос = 0;
		
		Для Каждого Вариант Из ТаблицаВариантовОтветов Цикл
			
			Если Вариант.Выбран Тогда
				БаллЗаПсихологическийВопрос = БаллЗаПсихологическийВопрос + Вариант.БаллПриПсихологическомТестировании;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Последовательность Тогда
		
		// Прибавляем к коду варианта код его группы.
		
		Для Каждого Вариант Из ТаблицаВариантовОтветов Цикл
			
			Группа = ТаблицаГруппВариантов.Найти(Вариант.Группа, "Группа");
			
			Если Группа = Неопределено Тогда
				Вариант.Код = Число(Строка(Вариант.Код) + Строка(Вариант.Код));
			Иначе
				Вариант.Код = Число(Строка(Группа.Код) + Строка(Вариант.Код));
			КонецЕсли;
			
			// Варианты могут быть вложены в группы и для правильного контроля
			// Последовательности меняем коды вариантов, с учетом кода группы,
			// При этом для варианта без группы считаем, что вариант вложен сам
			// В себя для правильного учета последовательности.
			
		КонецЦикла;
		
		ТаблицаВариантовОтветов.Сортировать("Код");
		ТаблицаВариантовОтветов.Колонки.Добавить("МассивДопустимыхПозиций");
		
		// Формируем массивы допустимых позиций варианта для каждого варианта.
		// У варианта может быть несколько верных позиций, если два варианта имеют один код.
		
		НомерСтроки = 1;
		Для Каждого Вариант Из ТаблицаВариантовОтветов Цикл
			
			МассивДопустимыхПозиций = Вариант.МассивДопустимыхПозиций;
			Если МассивДопустимыхПозиций = Неопределено Тогда
				МассивДопустимыхПозиций = Новый Массив();
			КонецЕсли;
			МассивДопустимыхПозиций.Добавить(НомерСтроки);
			Вариант.МассивДопустимыхПозиций = МассивДопустимыхПозиций;
			
			Отбор = Новый Структура();
			Отбор.Вставить("Код", Вариант.Код);
			
			ДругиеСтрокиСТакимЖеКодом = ТаблицаВариантовОтветов.НайтиСтроки(Отбор);
			ДругиеСтрокиСТакимЖеКодом.Удалить(ДругиеСтрокиСТакимЖеКодом.Найти(Вариант));
			
			Для каждого Строка Из ДругиеСтрокиСТакимЖеКодом Цикл
				МассивПозицийВариантаСТакимЖеКодом = Строка.МассивДопустимыхПозиций;
				Если МассивПозицийВариантаСТакимЖеКодом = Неопределено Тогда
					МассивПозицийВариантаСТакимЖеКодом = Новый Массив();
				КонецЕсли;
				МассивПозицийВариантаСТакимЖеКодом.Добавить(НомерСтроки);
				Строка.МассивДопустимыхПозиций = МассивПозицийВариантаСТакимЖеКодом;
			КонецЦикла;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		// Считаем результат
		
		КоличествоВерных = 0;
		
		Для Каждого Вариант Из ТаблицаВариантовОтветов Цикл
			Для каждого ДопустимаяПозиция Из Вариант.МассивДопустимыхПозиций Цикл
				Если ДопустимаяПозиция = Вариант.ПозицияВарианта Тогда
					КоличествоВерных = КоличествоВерных + 1;
					Прервать;
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла;
		
		
		МетодРасчетаРезультата = Вопрос.МетодРасчетаРезультата;
		
		Если МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ПроцентВерных
			И ТаблицаВариантовОтветов.Количество() > 0 Тогда
			
			Результат = Окр((КоличествоВерных / ТаблицаВариантовОтветов.Количество())*100);
			
		Иначе
			
			Если КоличествоВерных = ТаблицаВариантовОтветов.Количество() Тогда
				Результат = 100;
			Иначе
				Результат = 0;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ПоШаблону Тогда
		
		////////////////////////////////////////////////////////////////////////
		ВыборкаВсехДанныхВопроса = ОбъектыСУЗ.ПолучитьДанные(Вопрос,,Истина);
		////////////////////////////////////////////////////////////////////////
		
		// Проверяем правильность ответа
		
		ВерныхОтветов = 0;
		ВсегоШаблонов = 0;
		
		// Обрабатываем группы вариантов
		
		Для каждого ГруппаОтветов Из ТаблицаГруппВариантов Цикл
			
			ВсегоШаблонов = ВсегоШаблонов + 1;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Группа", ГруппаОтветов.Группа);
			ВариантыГруппы = ТаблицаВариантовОтветов.НайтиСтроки(ПараметрыОтбора);
			
			Если ВариантыГруппы.Количество() = 0 Тогда
				ВерныхОтветов = ВерныхОтветов + 1; // Если нет вариантов в группе, то считаем, что любой ответ верный.
			Иначе			
			
				// Ответ выбран пользователем и в таблице вариантов отмечен как выбранный.
				Если ГруппаОтветов.ПредлагатьВыборВариантов Тогда

					Для каждого ВариантГруппы Из ВариантыГруппы Цикл
						Если ВариантГруппы.Выбран И ВариантГруппы.Верный Тогда
							ВерныхОтветов = ВерныхОтветов + 1;
						КонецЕсли;
					КонецЦикла;
					
				// Ответ введен с клавиатуры
				Иначе
					
					ОтветПоШаблонуВТЧ = ОтветыПоШаблону.Найти(ГруппаОтветов.Группа, "ГруппаВариантов");
					
					Если ОтветПоШаблонуВТЧ <> Неопределено Тогда
						ОтветПользователя = НРег(ОтветПоШаблонуВТЧ.ТекстОтвета);
					Иначе
						ОтветПользователя = "";
					КонецЕсли;
					
					Для каждого ВариантГруппы Из ВариантыГруппы Цикл
						ВыборкаВсехДанныхВопроса.Сбросить();
						Если ВариантГруппы.Верный И ВыборкаВсехДанныхВопроса.НайтиСледующий(ВариантГруппы.ВариантОтвета, "КодДанных") Тогда
							ТекстОтвета = НРег(ВыборкаВсехДанныхВопроса.ТекстовыеДанные);
							Если ТекстОтвета = ОтветПользователя Тогда
    							ВерныхОтветов = ВерныхОтветов + 1;
    							Прервать;
    						КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
		
		// Обрабатываем основной ответ пользователя (без группы)
		
		ПустаяГруппа = Справочники.ВариантыОтветовНаВопросСУЗ.ПустаяСсылка();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Группа", ПустаяГруппа);
		ВариантыБезГруппы = ТаблицаВариантовОтветов.НайтиСтроки(ПараметрыОтбора);
		
		Если ВариантыБезГруппы.Количество() > 0 Тогда
			
			ВсегоШаблонов = ВсегоШаблонов + 1;
			
			ОтветПоШаблонуВТЧ = ОтветыПоШаблону.Найти(ПустаяГруппа, "ГруппаВариантов");

			Если ОтветПоШаблонуВТЧ <> Неопределено Тогда
				ОтветПользователя = НРег(ОтветПоШаблонуВТЧ.ТекстОтвета);
			Иначе
				ОтветПользователя = "";
			КонецЕсли;
			
			Для каждого ВариантБезГруппы Из ВариантыБезГруппы Цикл
				ВыборкаВсехДанныхВопроса.Сбросить();
				Если ВариантБезГруппы.Верный И ВыборкаВсехДанныхВопроса.НайтиСледующий(ВариантБезГруппы.ВариантОтвета, "КодДанных") Тогда
					ТекстОтвета = НРег(ВыборкаВсехДанныхВопроса.ТекстовыеДанные);
					Если ТекстОтвета = ОтветПользователя Тогда
						ВерныхОтветов = ВерныхОтветов + 1;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			
		КонецЕсли;
		
		МетодРасчетаРезультата = Вопрос.МетодРасчетаРезультата;
		
		Если МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ПроцентВерных Тогда
			Результат = Окр((ВерныхОтветов / ВсегоШаблонов)*100);
		Иначе
			Если ВерныхОтветов = ВсегоШаблонов Тогда
				Результат = 100;
			Иначе
				Результат = 0;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Соответствие
		ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.Таблица Тогда
		
		КоличествоВерныхВариантов = 0;
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Соответствие Тогда
			Для каждого Вариант Из ТаблицаВариантовОтветов Цикл
				ВариантВТЧ = ВариантыОтветов.Найти(Вариант.ВариантОтвета, "ВариантОтвета");
				Если Вариант.ВыбраннаяГруппа = Вариант.Группа Тогда
					КоличествоВерныхВариантов = КоличествоВерныхВариантов + 1;
					Если НЕ ЗначениеЗаполнено(Вариант.Группа) Тогда
						ВариантВТЧ.ОшибочныйНеВыбран = Истина;
					Иначе
						ВариантВТЧ.ВерныйВыбран = Истина;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Вариант.Группа) Тогда
						ВариантВТЧ.ОшибочныйВыбран = Истина;
					Иначе
						ВариантВТЧ.ВерныйНеВыбран = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Таблица Тогда
			Для каждого Вариант Из ТаблицаВариантовОтветов Цикл
				ВариантВТЧ = ВариантыОтветов.Найти(Вариант.ВариантОтвета, "ВариантОтвета");
				Если Вариант.ВыбраннаяГруппа = Вариант.Группа И Вариант.ВыбраннаяКатегория = Вариант.Категория Тогда
					КоличествоВерныхВариантов = КоличествоВерныхВариантов + 1;
					Если НЕ ЗначениеЗаполнено(Вариант.Группа) ИЛИ НЕ ЗначениеЗаполнено(Вариант.Категория) Тогда
						ВариантВТЧ.ОшибочныйНеВыбран = Истина;
					Иначе
						ВариантВТЧ.ВерныйВыбран = Истина;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Вариант.Группа) ИЛИ НЕ ЗначениеЗаполнено(Вариант.Категория) Тогда
						ВариантВТЧ.ОшибочныйВыбран = Истина;
					Иначе
						ВариантВТЧ.ВерныйНеВыбран = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
			
		МетодРасчетаРезультата = Вопрос.МетодРасчетаРезультата;

		Если МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ПроцентВерных Тогда
			Результат = Окр((КоличествоВерныхВариантов / ТаблицаВариантовОтветов.Количество())*100);
		Иначе
			Если КоличествоВерныхВариантов = ТаблицаВариантовОтветов.Количество() Тогда
				Результат = 100;
			Иначе
				Результат = 0;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ЭлементActiveX Тогда
    	
    	Результат = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "score");
		
		Если НЕ ПустаяСтрока(Результат) Тогда
			
			Попытка
				Результат = Число(Результат);
			Исключение
				Результат = 0;
			КонецПопытки;
			
			Если Результат > 100 Тогда
				Результат = 100;
			КонецЕсли;
			
			Если Результат < 0 Тогда
				Результат = 0;
			КонецЕсли;
			
    	Иначе
			
			Результат = 0;
			
    	КонецЕсли;
		
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.РаботаВПрограмме Тогда

		// Сохраняем ответ пользователя в документе
		
		Для каждого СтрокаТЧЭ Из ЭтапыРаботыВПрограмме Цикл
		
			ИмяПараметра = "programmAnswer_" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(СтрокаТЧЭ.НомерСтроки);
			ОтветПользователя = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, ИмяПараметра);
			
			Если НЕ ПустаяСтрока(ОтветПользователя) Тогда
				СтрокаТЧЭ.ОтветПользователя = ОтветПользователя;
			КонецЕсли;
		
		КонецЦикла;
		
		// Получаем данные для обработки
		
		ДанныеПП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Вопрос.ПрограммныйПродукт, "Обработка, Тип");
		
		ТаблицаЭтапов = ЭтапыРаботыВПрограмме.Выгрузить(); // Табличная часть документа
		
		ТаблицаПараметров = Вопрос.Параметры.Выгрузить(); 
		
		Для каждого Строка Из ТаблицаПараметров Цикл
			
			Если НЕ Строка.ЗаполняетсяПрограммой Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаСоЗначениемЭтапа = Параметры.Найти(Строка.Код, "Код"); // Ищем значение в документе
			
			Если СтрокаСоЗначениемЭтапа = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.Значение = СтрокаСоЗначениемЭтапа.Значение;
			
		КонецЦикла;
		
		Обработка = Справочники.ПрограммныеПродуктыСУЗ.ОписаниеОбработки(ДанныеПП.Обработка, Поставщик); 
		
		ДанныеДляОбработки = Новый Структура("Этапы, Параметры, Обработка", ТаблицаЭтапов, ТаблицаПараметров, Обработка);
		
		// Обрабатываем данные
		
		РезультатОбработки = Справочники.ПрограммныеПродуктыСУЗ.ОбработатьОтветПользователя(ДанныеДляОбработки, Вопрос.ПрограммныйПродукт, ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения));
		
		Если РезультатОбработки.Код <> 0 Тогда
			Возврат РезультатОбработки;
		КонецЕсли;
		
		// Сохраняем данные обработки в документе
		
		Для каждого СтрокаТЧ Из ЭтапыРаботыВПрограмме Цикл
			
			НовыеСвойстваЭтапа = ДанныеДляОбработки.Этапы.Найти(СтрокаТЧ.Код, "Код");
			
			Если НовыеСвойстваЭтапа = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, НовыеСвойстваЭтапа);
			
		КонецЦикла;
		
		Для каждого СтрокаТЧ Из Параметры Цикл
				
			СтрокаСоЗначениемПараметра = ДанныеДляОбработки.Параметры.Найти(СтрокаТЧ.Код, "Код");
			
			Если СтрокаСоЗначениемПараметра = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЧ.Значение = СтрокаСоЗначениемПараметра.Значение;
			
		КонецЦикла;
		
		// Считаем результат
		
		МаксимумБалловЗаЭтапы = ЭтапыРаботыВПрограмме.Количество()*100;
		НабраноБалловЗаЭтапы  = 0;
		
		Для каждого СтрокаТЧ Из ЭтапыРаботыВПрограмме Цикл
			
			Если НЕ СтрокаТЧ.Завершен Тогда
				НабраноБалловЗаЭтапы = 0;
				Прервать;
			КонецЕсли;
			
			НабраноБалловЗаЭтапы = НабраноБалловЗаЭтапы + СтрокаТЧ.Результат;
			
		КонецЦикла;
		
		Если МаксимумБалловЗаЭтапы > 0 Тогда 
			Результат = Окр((НабраноБалловЗаЭтапы / МаксимумБалловЗаЭтапы)*100);
		Иначе
			Результат = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	// Штрафуем за подсказку
	
	Если ИспользованаПодсказка Тогда
		Результат = Результат - Вопрос.ШтрафЗаПодсказку;
		Если Результат < 0 Тогда
			Результат = 0;
		КонецЕсли;
	КонецЕсли;
	
	// Смотрим, необходима ли в дальнейшем оценка преподавателем.
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Открытый
		ИЛИ Справочники.ВопросыСУЗ.РазрешенРазвернутыйОтветНаВопрос(Вопрос, ДанныеПодборки) Тогда
		
		ПроверяетсяПреподавателем = Истина;
		
	КонецЕсли;	
	
  	// Определяем отвечен ли вопрос
	
	ВопросОтвечен = Истина;
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.РаботаВПрограмме
		И ЭтапыРаботыВПрограмме.Количество() > 0 Тогда 
		
		Для каждого СтрокаТЧ Из ЭтапыРаботыВПрограмме Цикл
			
			Если НЕ СтрокаТЧ.Завершен Тогда
				ВопросОтвечен = Ложь;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	ДатаОтвета = ТекущаяДата();
	
	// Записываем документ
	
  	Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат РезультатОбработки;
	
КонецФункции

// Выполняет действия при получении подсказки на вопрос.
//
Функция ОбработатьПолучениеПодсказки(ПараметрыСсылки) Экспорт
	
	ИспользованаПодсказка = Истина;
	
	Записать(РежимЗаписиДокумента.Проведение);
	
	РезультатОбработки = Новый Структура("Код, Текст", 0, "");
	
	Возврат РезультатОбработки;

КонецФункции

// Выполняет действия при запросе на повторный ответ на вопрос.
//
Функция ОбработатьЗапросНаПовторныйОтвет(ПараметрыСсылки) Экспорт
	
	РезультатОбработки = Новый Структура("Код, Текст", 0, "");
	
	НоваяИсторияОтвета = ИсторияОтветовНаВопрос.Добавить();
	
	НоваяИсторияОтвета.ДатаОтвета = ДатаОтвета;
	ДатаОтвета                    = Дата("00010101");
	
	ВремяВыполненияВопроса = Дата("00010101");
	ВопросОтвечен          = Ложь;
	
	НоваяИсторияОтвета.Результат = Результат;
	Результат                    = 0;
	
	НоваяИсторияОтвета.РазвернутыйОтветПользователя = РазвернутыйОтветПользователя;
	РазвернутыйОтветПользователя                    = "";
	
	НоваяИсторияОтвета.ПроверенПреподавателем = ПроверенПреподавателем;
	ПроверенПреподавателем                    = Ложь;
	
	НоваяИсторияОтвета.ПроверившийПреподаватель = ПроверившийПреподаватель;
	ПроверившийПреподаватель                    = Справочники.Пользователи.ПустаяСсылка();
	
	НоваяИсторияОтвета.ДатаОтменыПопытки = ТекущаяДата();
	
	ИспользованаПодсказка = Ложь;
	
	ВариантыОтветов.Очистить();
	ГруппыВариантовОтветов.Очистить();
	КатегорииВариантовОтветов.Очистить();
	ОтветыПоШаблону.Очистить();
	ЭтапыРаботыВПрограмме.Очистить();
	Параметры.Очистить();
	
	Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат РезультатОбработки;
	
КонецФункции

// Выполняет действия при выставлении оценки преподавателем.
//
Функция ОбработатьОценкуПреподавателя(ПараметрыСсылки, КонтекстВыполнения) Экспорт
	
	РезультатОбработки = Новый Структура("Код, Текст", 0, "");

	ПроверенПреподавателем = Истина;
	ПроверившийПреподаватель = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения);
	КомментарийПреподавателя = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "teacherComment");
	
	Результат = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "scoreTeacher");
	
	Попытка
		Результат = Число(Результат);
	Исключение
		Результат = 0;
	КонецПопытки;
	
	Если Результат < 0 Тогда
		Результат = 0;
	КонецЕсли;
	
	Если Результат > 100 Тогда
		Результат = 100;
	КонецЕсли;
	
	Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОтветыНаВопросыСУЗ.Записывать = Истина;
	Движения.ВыбранныеВариантыОтветовВопросовСУЗ.Записывать = Истина;	
	Движения.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.Записывать = Истина;
	
	ДанныеСессииТеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СессияВыполненияТеста, "ПрохождениеОбучения, Задание, СводЗнаний, ЭлементСодержанияСводаЗнаний, Подборка");
	
	Если ЭлектронныеРесурсыПереопределяемый.ОбучениеОтменено(Отменено, ДанныеСессииТеста.ПрохождениеОбучения, ДанныеСессииТеста.Задание) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВопросОтвечен И ЗначениеЗаполнено(СессияВыполненияТеста) Тогда
				
		// Движение по ОтветыНаВопросыСУЗ
		
		Движение = Движения.ОтветыНаВопросыСУЗ.Добавить();
		
		Движение.Период = ДатаОтвета;
		Движение.Пользователь = Пользователь;
		Движение.Вопрос = Вопрос;
		Движение.ПрохождениеОбучения = ДанныеСессииТеста.ПрохождениеОбучения;
		Движение.Задание = ДанныеСессииТеста.Задание;
		
		ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ДанныеСессииТеста.ПрохождениеОбучения);		
		
		Движение.ЭлементСодержания = ДанныеСессииТеста.ЭлементСодержанияСводаЗнаний;		
		Движение.Результат = Результат;		
		Движение.ЭлектронныйРесурс = ДанныеСессииТеста.СводЗнаний;
		Движение.Тест = ДанныеСессииТеста.Подборка; 
		Движение.ПроверяетсяПреподавателем = ПроверяетсяПреподавателем;
		Движение.ПроверенПреподавателем = ПроверенПреподавателем;
		Движение.ПроверившийПреподаватель = ПроверившийПреподаватель;
		Движение.СессияВыполненияТеста = СессияВыполненияТеста;
		Движение.КоличествоПоказов = КоличествоПоказов;
		Движение.ИспользованаПодсказка = ИспользованаПодсказка;
		Движение.ПсихологическийВопрос = ПсихологическийВопрос;
		Движение.РазвернутыйОтветПользователя = РазвернутыйОтветПользователя;
		Движение.КомментарийПреподавателя = КомментарийПреподавателя;
		
		Для каждого СтрокаТЧ Из ОтветыПоШаблону Цикл
		
			Движение.РазвернутыйОтветПользователя = Движение.РазвернутыйОтветПользователя + СтрокаТЧ.ТекстОтвета + " "
		
		КонецЦикла;
		
		// Движение по ВыбранныеВариантыОтветовВопросовСУЗ
		
		Для каждого Строка Из ВариантыОтветов Цикл
		
			Движение = Движения.ВыбранныеВариантыОтветовВопросовСУЗ.Добавить();
			
			Движение.Период = ДатаОтвета;
			Движение.СессияВыполненияТеста = СессияВыполненияТеста;
			Движение.Пользователь = Пользователь;
			Движение.Вопрос = Вопрос;
			Движение.ВариантОтвета = Строка.ВариантОтвета;
			
			Движение.ПрохождениеОбучения = ДанныеСессииТеста.ПрохождениеОбучения;
			
			ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ДанныеСессииТеста.ПрохождениеОбучения);

			Движение.Задание = ДанныеСессииТеста.Задание;			
			Движение.ЭлементСодержания = ДанныеСессииТеста.ЭлементСодержанияСводаЗнаний;			
			Движение.Выбран = Строка.Выбран;			
			Движение.ЭлектронныйРесурс = ДанныеСессииТеста.СводЗнаний;
			Движение.Тест = ДанныеСессииТеста.Подборка;
			Движение.Номер = Строка.НомерВарианта;
			Движение.ВерныйВыбран = Строка.ВерныйВыбран;
			Движение.ВерныйНеВыбран = Строка.ВерныйНеВыбран;
			Движение.ОшибочныйВыбран = Строка.ОшибочныйВыбран;
			Движение.ОшибочныйНеВыбран = Строка.ОшибочныйНеВыбран;
			
		КонецЦикла;
		
		// Движение по ПовторноеПрохождениеЭлектронныхРесурсовСУЗ
		
		Если Результат < 100 Тогда
		
			АвтоРубрикатор = Справочники.РубрикаторыСУЗ.ПолучитьСсылку(ДанныеСессииТеста.СводЗнаний.УникальныйИдентификатор());
		
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(АвтоРубрикатор, Ложь) Тогда		
				
				АвтоРубрики = РегистрыСведений.РубрикиОбъектовСУЗ.РубрикиЭлемента(АвтоРубрикатор, Вопрос);
				
				Для каждого АвтоРубрика Из АвтоРубрики Цикл
				
					Движение = Движения.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.Добавить();
					Движение.Период = ДатаОтвета;
					Движение.Пользователь = Пользователь;
					Движение.ПрохождениеОбучения = ДанныеСессииТеста.ПрохождениеОбучения;
					Движение.Задание = ДанныеСессииТеста.Задание;
					Движение.ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(АвтоРубрика.УникальныйИдентификатор());
					
				КонецЦикла;			
				
			КонецЕсли;

		КонецЕсли;			
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
